create_clock -period 20.000 -name ap_clk [get_ports ap_clk]

set_input_delay -clock ap_clk -min 2.000 [get_ports ap_rst_n]
set_input_delay -clock ap_clk -max 2.000 [get_ports ap_rst_n]
set_input_delay -clock ap_clk -min 2.000 [get_ports m_axis_0_tready]
set_input_delay -clock ap_clk -max 2.000 [get_ports m_axis_0_tready]
set_input_delay -clock ap_clk -min 2.000 [get_ports {s_axis_0_tdata[0]}]
set_input_delay -clock ap_clk -max 2.000 [get_ports {s_axis_0_tdata[0]}]
set_input_delay -clock ap_clk -min 2.000 [get_ports {s_axis_0_tdata[1]}]
set_input_delay -clock ap_clk -max 2.000 [get_ports {s_axis_0_tdata[1]}]
set_input_delay -clock ap_clk -min 2.000 [get_ports {s_axis_0_tdata[2]}]
set_input_delay -clock ap_clk -max 2.000 [get_ports {s_axis_0_tdata[2]}]
set_input_delay -clock ap_clk -min 2.000 [get_ports {s_axis_0_tdata[3]}]
set_input_delay -clock ap_clk -max 2.000 [get_ports {s_axis_0_tdata[3]}]
set_input_delay -clock ap_clk -min 2.000 [get_ports {s_axis_0_tdata[4]}]
set_input_delay -clock ap_clk -max 2.000 [get_ports {s_axis_0_tdata[4]}]
set_input_delay -clock ap_clk -min 2.000 [get_ports {s_axis_0_tdata[5]}]
set_input_delay -clock ap_clk -max 2.000 [get_ports {s_axis_0_tdata[5]}]
set_input_delay -clock ap_clk -min 2.000 [get_ports {s_axis_0_tdata[6]}]
set_input_delay -clock ap_clk -max 2.000 [get_ports {s_axis_0_tdata[6]}]
set_input_delay -clock ap_clk -min 2.000 [get_ports {s_axis_0_tdata[7]}]
set_input_delay -clock ap_clk -max 2.000 [get_ports {s_axis_0_tdata[7]}]
set_input_delay -clock ap_clk -min 2.000 [get_ports s_axis_0_tvalid]
set_input_delay -clock ap_clk -max 2.000 [get_ports s_axis_0_tvalid]

set_output_delay -clock ap_clk -min 2.000 [get_ports s_axis_0_tready]
set_output_delay -clock ap_clk -max 2.000 [get_ports s_axis_0_tready]
set_output_delay -clock ap_clk -min 2.000 [get_ports m_axis_0_tvalid]
set_output_delay -clock ap_clk -max 2.000 [get_ports m_axis_0_tvalid]
set_output_delay -clock ap_clk -min 2.000 [get_ports {m_axis_0_tdata[0]}]
set_output_delay -clock ap_clk -max 2.000 [get_ports {m_axis_0_tdata[0]}]
set_output_delay -clock ap_clk -min 2.000 [get_ports {m_axis_0_tdata[1]}]
set_output_delay -clock ap_clk -max 2.000 [get_ports {m_axis_0_tdata[1]}]
set_output_delay -clock ap_clk -min 2.000 [get_ports {m_axis_0_tdata[2]}]
set_output_delay -clock ap_clk -max 2.000 [get_ports {m_axis_0_tdata[2]}]
set_output_delay -clock ap_clk -min 2.000 [get_ports {m_axis_0_tdata[3]}]
set_output_delay -clock ap_clk -max 2.000 [get_ports {m_axis_0_tdata[3]}]


set_property IOSTANDARD LVCMOS18 [get_ports ap_clk]
set_property IOSTANDARD LVCMOS18 [get_ports {s_axis_0_tdata[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {s_axis_0_tdata[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {s_axis_0_tdata[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {s_axis_0_tdata[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {s_axis_0_tdata[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {s_axis_0_tdata[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {s_axis_0_tdata[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {s_axis_0_tdata[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports s_axis_0_tready]
set_property IOSTANDARD LVCMOS18 [get_ports s_axis_0_tvalid]
set_property IOSTANDARD LVCMOS18 [get_ports {m_axis_0_tdata[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {m_axis_0_tdata[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {m_axis_0_tdata[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {m_axis_0_tdata[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {m_axis_0_tdata[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {m_axis_0_tdata[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {m_axis_0_tdata[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {m_axis_0_tdata[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports m_axis_0_tready]
set_property IOSTANDARD LVCMOS18 [get_ports m_axis_0_tvalid]
set_property IOSTANDARD LVCMOS18 [get_ports ap_rst_n]
set_property PACKAGE_PIN N17 [get_ports ap_clk]
set_property PACKAGE_PIN P17 [get_ports {s_axis_0_tdata[7]}]
set_property PACKAGE_PIN P15 [get_ports {s_axis_0_tdata[6]}]
set_property PACKAGE_PIN R16 [get_ports {s_axis_0_tdata[5]}]
set_property PACKAGE_PIN N13 [get_ports {s_axis_0_tdata[4]}]
set_property PACKAGE_PIN N14 [get_ports {s_axis_0_tdata[3]}]
set_property PACKAGE_PIN P16 [get_ports {s_axis_0_tdata[2]}]
set_property PACKAGE_PIN R17 [get_ports {s_axis_0_tdata[1]}]
set_property PACKAGE_PIN N15 [get_ports {s_axis_0_tdata[0]}]
set_property PACKAGE_PIN V19 [get_ports s_axis_0_tready]
set_property PACKAGE_PIN R14 [get_ports s_axis_0_tvalid]
set_property PACKAGE_PIN T18 [get_ports ap_rst_n]
set_property PACKAGE_PIN AB20 [get_ports {m_axis_0_tdata[7]}]
set_property PACKAGE_PIN V17 [get_ports {m_axis_0_tdata[6]}]
set_property PACKAGE_PIN W17 [get_ports {m_axis_0_tdata[5]}]
set_property PACKAGE_PIN AA18 [get_ports {m_axis_0_tdata[4]}]
set_property PACKAGE_PIN AB18 [get_ports {m_axis_0_tdata[3]}]
set_property PACKAGE_PIN U17 [get_ports {m_axis_0_tdata[2]}]
set_property PACKAGE_PIN U18 [get_ports {m_axis_0_tdata[1]}]
set_property PACKAGE_PIN P14 [get_ports {m_axis_0_tdata[0]}]
set_property PACKAGE_PIN R18 [get_ports m_axis_0_tready]
set_property PACKAGE_PIN AA19 [get_ports m_axis_0_tvalid]
set_property CONFIG_VOLTAGE 1.8 [current_design]
set_property CFGBVS GND [current_design]
set_property BITSTREAM.GENERAL.JTAG_XADC DISABLE [current_design]
set_property BITSTREAM.GENERAL.XADCPOWERDOWN ENABLE [current_design]
set_property CLOCK_DEDICATED_ROUTE FALSE [get_nets ap_clk_IBUF]

set_property ram_decomp power [get_cells -hier finn_design_i]